# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8-Worldv2 with Gaussian Splatting Preprocessor
# Prepends a differentiable 2D Gaussian rendering pipeline before the YOLO backbone.
# The preprocessor learns to reconstruct images via sparse Gaussians that maximize detection.
# Model docs: https://docs.ultralytics.com/models/yolo-world
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.50, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone with Gaussian Preprocessor at index 0
backbone:
  # [from, repeats, module, args]
  # --- Gaussian Preprocessor (index 0) ---
  # GaussianPreprocessor args: [img_h, img_w, num_gaussians, feat_channels, hidden_channels, hidden_dim, use_tiled, temperature, min_scale, blend]
  # Input: [B, 3, H, W] → Output: [B, 3, H, W]
  - [-1, 1, GaussianPreprocessor, [640, 640, 2000, 32, [16, 32], 192, True, 1.0, 0.5, 'cnn', False, False, True, False, False, 0.5, 'deformable_transformer', False]]  # 0 - preprocessor

  # --- Standard YOLO backbone (indices shifted by +1) ---
  - [-1, 1, Conv, [64, 3, 2]]    # 1-P1/2
  - [-1, 1, Conv, [128, 3, 2]]   # 2-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]   # 4-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]   # 6-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 8-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]     # 10

# YOLOv8.0n head (indices shifted by +1 due to preprocessor)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]   # cat backbone P4
  - [-1, 3, C2fAttn, [512, 256, 8]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]   # cat backbone P3
  - [-1, 3, C2fAttn, [256, 128, 4]] # 16 (P3/8-small)

  - [16, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2fAttn, [512, 256, 8]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2fAttn, [1024, 512, 16]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, WorldDetect, [nc, 512, True]] # WorldDetect(P3, P4, P5)
